<?php
/**
 *过滤助手
 * @author gaoxiangdong<gxd_dnjlw@163.com>
 * @copyright 2017-03-22
 */

namespace app\helpers;

use Yii;

/**
 *
 */
class FilterHelper
{
  /**
   * 项目全局自定义函数库：驼峰命名法
   * 本文件仅存放项目通用的一些工具函数，项目私有函数，请另建文件存放
   * 追加函数，请务必保持统一注释风格，注释中要包含 函数功能、参数、返回值类型
   * 分类导航：验证类、转换类、工具类、排序类、算法类、时间类、过滤类、拼割类
   */

  /**
   * 2015-4-16
   *
   * @author gaoxiangdong
   * @version V1.0.0
   */

  /* * *********************************************************************** */
  /* * ************************** ********************************* */
  /* * ************************* 过滤类 ******************************** */
  /* * ************************** ********************************* */
  /* * *********************************************************************** */

  /*
   * ************************************************************
   *
   * 防注入,过滤特殊字符
   * @param mixed $array 需要过滤的数据
   * @return array
   * @access public
   *
   * ***********************************************************
   */
  public static sec(&$array)
  {
      // 如果是数组，遍历数组，递归调用
      if (is_array($array)) {
          foreach ($array as $k => $v) {
              $array[$k] = sec($v);
          }
      } else 
          if (is_string($array)) {
              // 使用addslashes函数来处理
              $array = addslashes($array);
          } else 
              if (is_numeric($array)) {
                  $array = intval($array);
              }
      return $array;
  }

  /*
   * ************************************************************
   *
   * 功能：去除英文单双引符号
   * @param string $str 需要过滤的字符串
   * @return string
   * @access public
   *
   * ***********************************************************
   */
  public static check_clsspecialsign($str)
  {
      $str = str_replace("\'", '', $str);
      $str = str_replace("\"", '', $str);
      return $str;
  }

}
